Tekla Open API Reference for Tekla Structures 2025
ClashCheckHandler.RunClashCheckWithOptions Method (Boolean, Boolean, Boolean, Double, Boolean)
 Starts the clash checking with options.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool RunClashCheckWithOptions(
	bool betweenReferenceModels,
	bool betweenReferenceModelsAndComponents,
	bool objectsInsideReferenceModels,
	double minDistance,
	bool betweenParts
)
Public Function RunClashCheckWithOptions (
	betweenReferenceModels As Boolean,
	betweenReferenceModelsAndComponents As Boolean,
	objectsInsideReferenceModels As Boolean,
	minDistance As Double,
	betweenParts As Boolean
) As Boolean
Parameters
betweenReferenceModels
Type: System.Boolean
True, if clash check should be performed between reference models.
betweenReferenceModelsAndComponents
Type: System.Boolean
True, if clash cehck should be performed between reference models and components.
objectsInsideReferenceModels
Type: System.Boolean
True, if clash check should be performed to objects inside reference models.
minDistance
Type: System.Double
The minimum distance value.
betweenParts
Type: System.Boolean
True, if clash check should be performed between native parts.
Return Value
Type: Boolean
True on success.
See Also
Reference
ClashCheckHandler Class
RunClashCheckWithOptions Overload
Tekla.Structures.Model Namespace